Core/src/Documents/СчетФактураОтправленныйГрузия/СчетФактураОтправленныйГрузия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СчетФактураОтправленныйГрузия</name>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыПоНалогам</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.АвансыОтправленныхФактур</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузоотправитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузополучатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыСФ</types>
    </type>
  </attributes>
  <attributes>
    <name>Серия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСчетФактуры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Аванс</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНалога</name>
    <type>
      <types>CatalogRef.ВидыНалогов</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>Корректировочная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаКорректировки</name>
    <type>
      <types>EnumRef.ПричиныКорректировкиСФ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеКорректировки</name>
    <type>
      <types>DocumentRef.СчетФактураОтправленныйГрузия</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.КорректировкаРеализации</types>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.ПриходнаяНакладная</types>
        <types>DocumentRef.АктВыполненныхРабот</types>
        <types>DocumentRef.ЧекККМ</types>
        <types>DocumentRef.ЗаказПокупателя</types>
        <types>DocumentRef.Взаимозачет</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.ПартииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтранаПроисхождения</name>
      <type>
        <types>CatalogRef.СтраныМира</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерГТД</name>
      <type>
        <types>CatalogRef.НомераГТД</types>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыПлатежа</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.ПоступлениеВКассу</types>
        <types>DocumentRef.Взаимозачет</types>
        <types>DocumentRef.ПоступлениеНаСчет</types>
        <types>DocumentRef.ОперацияПоПлатежнымКартам</types>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/ChartsOfAccounts/Хозрасчетный/Хозрасчетный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>Хозрасчетный</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконтоХозрасчетные</extDimensionTypes>
  <predefined>
    <items>
      <name>Вспомогательный</name>
      <description>Вспомогательный счет</description>
      <code>0000   </code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>ПереводыВПути</name>
      <description>Переводы в пути</description>
      <code>1290   </code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>РасчетыПоАвансамВыданным</name>
      <description>Расчеты по авансам выданным</description>
      <code>1480   </code>
    </items>
    <items>
      <name>Товары</name>
      <description>Товары</description>
      <code>1610   </code>
    </items>
    <items>
      <name>ПоставляемыеМатериалы</name>
      <description>გადაცემული მარაგები</description>
      <code>1629      </code>
    </items>
    <items>
      <name>РасчетыСПоставщикамиИПодрядчиками</name>
      <description>Расчеты с поставщиками и подрядчиками</description>
      <code>3100   </code>
      <accountType>Passive</accountType>
      <childItems>
        <name>РасчетыСПоставщиками</name>
        <description>Расчеты с поставщиками</description>
        <code>3110   </code>
        <accountType>Passive</accountType>
      </childItems>
    </items>
    <items>
      <name>НалоговыеОбязательства</name>
      <description>გადასახდელი დღგ</description>
      <code>3330   </code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>НалоговыеОбязательства_1</name>
      <description>გადასახდელი დღგ (/1)</description>
      <code>3330/1    </code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>НачисленныйНДСНаПолученныйАванс</name>
      <description>მიღებულ ავანსზე დარიცხული დღგ</description>
      <code>3331   </code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>ПредворительныйЗачетПолученныйНаВыдааныАванс</name>
      <description>გაცემულ ავანსზე მიღებული წინასწარი ჩათვლა</description>
      <code>3332   </code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>НДС</name>
      <description>გადახდილი დღგ</description>
      <code>3340   </code>
    </items>
    <items>
      <name>НДС_1</name>
      <description>გადახდილი დღგ (/1)</description>
      <code>3340/1    </code>
    </items>
    <items>
      <name>ОплаченныеКОплатеНДСНаАванс</name>
      <description>ავანსზე გადახდილი/გადასახდელი დღგ</description>
      <code>3341   </code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>ЗачетПолученногоНДСНаВыданныАванс</name>
      <description>გაცემულ ავანსის თანხებზე მიღებული დღგ-ს ჩათვლა</description>
      <code>3342   </code>
      <accountType>ActivePassive</accountType>
    </items>
  </predefined>
  <attributes>
    <name>ЗапретитьИспользоватьВПроводках</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодБыстрогоВыбора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетАналогУУ</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСчета</name>
    <type>
      <types>EnumRef.ТипыСчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРаспределения</name>
    <type>
      <types>EnumRef.БазыРаспределенияРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетЗакрытия</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаДоходовИРасходов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AzRyMapping</name>
    <type>
      <types>CatalogRef.AzRyMapping</types>
    </type>
  </attributes>
  <accountingFlags>
    <name>Валютный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <accountingFlags>
    <name>Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <accountingFlags>
    <name>УчетПоПодразделениям</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <accountingFlags>
    <name>НалоговыйУчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <extDimensionAccountingFlags>
    <name>Суммовой</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
  <extDimensionAccountingFlags>
    <name>Валютный</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
  <extDimensionAccountingFlags>
    <name>Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
</mdclass:ChartOfAccounts>

Core/src/Documents/СчетФактураОтправленныйГрузия/ManagerModule.bsl
Процедура ИнициализироватьДанныеДокумента(ДокументСчетФактураОтправленныйГрузия, СтруктураДополнительныеСвойства) Экспорт

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетФактураОтправленныйГрузияДокументыПлатежа.Ссылка,
		|	СчетФактураОтправленныйГрузияДокументыПлатежа.Ссылка.Организация,
		|	СчетФактураОтправленныйГрузияДокументыПлатежа.Ссылка.Контрагент,
		|	КОНЕЦПЕРИОДА(СчетФактураОтправленныйГрузияДокументыПлатежа.Ссылка.ДатаВходящегоДокумента, МЕСЯЦ) КАК Период,
		|	СчетФактураОтправленныйГрузияДокументыПлатежа.НомерСтроки КАК НомерСтроки,
		|	СчетФактураОтправленныйГрузияДокументыПлатежа.Документ,
		|	СчетФактураОтправленныйГрузияДокументыПлатежа.Договор,
		|	СчетФактураОтправленныйГрузияДокументыПлатежа.СуммаНДС КАК Сумма
		|ПОМЕСТИТЬ ДокументыПлатежа
		|ИЗ
		|	Документ.СчетФактураОтправленныйГрузия.ДокументыПлатежа КАК СчетФактураОтправленныйГрузияДокументыПлатежа
		|ГДЕ
		|	СчетФактураОтправленныйГрузияДокументыПлатежа.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", 		ДокументСчетФактураОтправленныйГрузия);
	Запрос.Выполнить();
	
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаХозрасчетный_СчетФактураОтправленныйГрузия(ДокументСчетФактураОтправленныйГрузия, СтруктураДополнительныеСвойства);
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаАвансыОтправленныхФактур_СчетФактураОтправленныйГрузия(ДокументСчетФактураОтправленныйГрузия, СтруктураДополнительныеСвойства);
	
	СформироватьТаблицаРасчетыПоНалогам(ДокументСчетФактураОтправленныйГрузия, СтруктураДополнительныеСвойства); // Kuzmich, 16.09.2019, Добавление бух проводок в счет фактурах
КонецПроцедуры

// Kuzmich, 16.09.2019, Добавление бух проводок в счет фактурах
Процедура СформироватьТаблицаРасчетыПоНалогам(ДокументСсылкаСчетФактураОтправленныйГрузия, СтруктураДополнительныеСвойства)
	
	Если ЗначениеЗаполнено(ДокументСсылкаСчетФактураОтправленныйГрузия.ВидНалога) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетФактураОтправленныйГрузияДокументыОснования.Ссылка.Дата КАК Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	СчетФактураОтправленныйГрузияДокументыОснования.Ссылка.Организация КАК Организация,
		|	СчетФактураОтправленныйГрузияДокументыОснования.ДокументОснование.ВидНалогаНДС КАК ВидНалога,
		|	СчетФактураОтправленныйГрузияДокументыОснования.Ссылка.СчетУчетаРегл КАК СчетУчета,
		|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НалоговыеОбязательства) КАК СрокУплаты,
		|	&СодержаниеПроводки КАК СодержаниеПроводки,
		|	СчетФактураОтправленныйГрузияДокументыОснования.СуммаНДС КАК Сумма
		|ИЗ
		|	Документ.СчетФактураОтправленныйГрузия.ДокументыОснования КАК СчетФактураОтправленныйГрузияДокументыОснования
		|ГДЕ
		|	СчетФактураОтправленныйГрузияДокументыОснования.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	СчетФактураОтправленныйГрузияДокументыОснования.Ссылка.Дата,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|	СчетФактураОтправленныйГрузияДокументыОснования.Ссылка.Организация,
		|	СчетФактураОтправленныйГрузияДокументыОснования.Ссылка.ВидНалога,
		|	СчетФактураОтправленныйГрузияДокументыОснования.Ссылка.СчетУчетаРегл,
		|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НалоговыеОбязательства),
		|	&СодержаниеПроводки,
		|	СчетФактураОтправленныйГрузияДокументыОснования.СуммаНДС
		|ИЗ
		|	Документ.СчетФактураОтправленныйГрузия.ДокументыОснования КАК СчетФактураОтправленныйГрузияДокументыОснования
		|ГДЕ
		|	СчетФактураОтправленныйГрузияДокументыОснования.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка",	ДокументСсылкаСчетФактураОтправленныйГрузия);
		Запрос.УстановитьПараметр("СодержаниеПроводки",	НСТР("ka='დღგ';ru='НДС';en='VAT'"));
		
		РезультатЗапроса = Запрос.Выполнить();
		врТаблицаРасчетыПоНалогам = РезультатЗапроса.Выгрузить();	
		врТаблицаРасчетыПоНалогам.Свернуть("Период,ВидДвижения,Организация,ВидНалога,СчетУчета,СрокУплаты,СодержаниеПроводки","Сумма");
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыПоНалогам", врТаблицаРасчетыПоНалогам);
		
	КонецЕсли;
КонецПроцедуры
// Kuzmich, 16.09.2019, Добавление бух проводок в счет фактурах
